cbeiler/sparrow-lorawan/Application/Core/Inc/stm32wlxx_hal_conf.h
// Copyright 2021 Blues Inc.  All rights reserved.
// Use of this source code is governed by licenses granted by the
// copyright holder including that found in the LICENSE file.

// HAL configuration
#pragma once

#define HAL_MODULE_ENABLED
#define HAL_ADC_MODULE_ENABLED
//#define HAL_COMP_MODULE_ENABLED
//#define HAL_CRC_MODULE_ENABLED
#define HAL_CRYP_MODULE_ENABLED
//#define HAL_DAC_MODULE_ENABLED
//#define HAL_GTZC_MODULE_ENABLED
//#define HAL_HSEM_MODULE_ENABLED
#define HAL_I2C_MODULE_ENABLED
//#define HAL_I2S_MODULE_ENABLED
//#define HAL_IPCC_MODULE_ENABLED
//#define HAL_IRDA_MODULE_ENABLED
//#define HAL_IWDG_MODULE_ENABLED
//#define HAL_LPTIM_MODULE_ENABLED
//#define HAL_PKA_MODULE_ENABLED
#define HAL_RNG_MODULE_ENABLED
#define HAL_RTC_MODULE_ENABLED
//#define HAL_SMARTCARD_MODULE_ENABLED
//#define HAL_SMBUS_MODULE_ENABLED
#define HAL_SPI_MODULE_ENABLED
#define HAL_SUBGHZ_MODULE_ENABLED
#define HAL_TIM_MODULE_ENABLED
#define HAL_UART_MODULE_ENABLED
#define HAL_USART_MODULE_ENABLED
//#define HAL_WWDG_MODULE_ENABLED
#define HAL_EXTI_MODULE_ENABLED
#define HAL_CORTEX_MODULE_ENABLED
#define HAL_DMA_MODULE_ENABLED
#define HAL_FLASH_MODULE_ENABLED
#define HAL_GPIO_MODULE_ENABLED
#define HAL_PWR_MODULE_ENABLED
#define HAL_RCC_MODULE_ENABLED

// Modules where Register Callback can be used
#define USE_HAL_ADC_REGISTER_CALLBACKS         0u
#define USE_HAL_COMP_REGISTER_CALLBACKS        0u
#define USE_HAL_CRYP_REGISTER_CALLBACKS        0u
#define USE_HAL_DAC_REGISTER_CALLBACKS         0u
#define USE_HAL_I2C_REGISTER_CALLBACKS         0u
#define USE_HAL_I2S_REGISTER_CALLBACKS         0u
#define USE_HAL_IRDA_REGISTER_CALLBACKS        0u
#define USE_HAL_LPTIM_REGISTER_CALLBACKS       0u
#define USE_HAL_PKA_REGISTER_CALLBACKS         0u
#define USE_HAL_RNG_REGISTER_CALLBACKS         0u
#define USE_HAL_RTC_REGISTER_CALLBACKS         0u
#define USE_HAL_SMARTCARD_REGISTER_CALLBACKS   0u
#define USE_HAL_SMBUS_REGISTER_CALLBACKS       0u
#define USE_HAL_SPI_REGISTER_CALLBACKS         0u
#define USE_HAL_SUBGHZ_REGISTER_CALLBACKS      0u
#define USE_HAL_TIM_REGISTER_CALLBACKS         0u
#define USE_HAL_UART_REGISTER_CALLBACKS        1u
#define USE_HAL_USART_REGISTER_CALLBACKS       1u
#define USE_HAL_WWDG_REGISTER_CALLBACKS        0u

// Oscillator Values
// Adjust the value of External High Speed oscillator (HSE) used in your application.
// This value is used by the RCC HAL module to compute the system frequency
// (when HSE is used as system clock source, directly or through the PLL).

#if !defined (HSE_VALUE)
#define HSE_VALUE                           32000000UL  /*!< Value of the External oscillator in Hz */
#endif

#if !defined (HSE_STARTUP_TIMEOUT)
#define HSE_STARTUP_TIMEOUT                 100UL       /*!< Time out for HSE start up, in ms */
#endif

// Internal Multiple Speed oscillator (MSI) default value.
// This value is the default MSI range value after Reset.
#if !defined  (MSI_VALUE)
#define MSI_VALUE                           4000000UL   /*!< Value of the Internal oscillator in Hz*/
#endif

// Internal High Speed oscillator (HSI) value.
// This value is used by the RCC HAL module to compute the system frequency
// (when HSI is used as system clock source, directly or through the PLL).
#if !defined  (HSI_VALUE)
#define HSI_VALUE                           16000000UL  /*!< Value of the Internal oscillator in Hz*/
#endif

// Internal Low Speed oscillator (LSI) value.
#if !defined (LSI_VALUE)
#define LSI_VALUE                           32000UL     /*!< Value of the Internal Low Speed oscillator in Hz
                                                             The real value may vary depending on the variations
                                                             in voltage and temperature. */
#endif

// External Low Speed oscillator (LSE) value.
// This value is used by the UART, RTC HAL module to compute the system frequency
#if !defined (LSE_VALUE)
#define LSE_VALUE                           32768UL     /*!< Value of the External oscillator in Hz*/
#endif

// Internal Multiple Speed oscillator (HSI48) default value.
// This value is the default HSI48 range value after Reset.
#if !defined (HSI48_VALUE)
#define HSI48_VALUE                         48000000UL  /*!< Value of the Internal oscillator in Hz*/
#endif

#if !defined (LSE_STARTUP_TIMEOUT)
#define LSE_STARTUP_TIMEOUT                 5000UL      /*!< Time out for LSE start up, in ms */
#endif

// HAL system configuration section
#define  VDD_VALUE                          3300U                             /*!< Value of VDD in mv */
#define  TICK_INT_PRIORITY                  ((1uL <<__NVIC_PRIO_BITS) - 1uL)  /*!< tick interrupt priority (lowest by default) */
#define  USE_RTOS                           0U
#define  PREFETCH_ENABLE                    0U
#define  INSTRUCTION_CACHE_ENABLE           1U
#define  DATA_CACHE_ENABLE                  1U

// Assert Selection ##############################
// Uncomment the line below to expand the "assert_param" macro in the HAL drivers
// #define USE_FULL_ASSERT    1

// SPI peripheral configuration
// CRC FEATURE: Use to activate CRC feature inside HAL SPI Driver
// Activated: CRC code is present inside driver
// Deactivated: CRC code cleaned from driver
#define USE_SPI_CRC                         1U

// CRYP peripheral configuration
#define USE_HAL_CRYP_SUSPEND_RESUME         1U

// Includes
#ifdef HAL_DMA_MODULE_ENABLED
#include "stm32wlxx_hal_dma.h"
#endif

#ifdef HAL_ADC_MODULE_ENABLED
#include "stm32wlxx_hal_adc.h"
#endif

#ifdef HAL_COMP_MODULE_ENABLED
#include "stm32wlxx_hal_comp.h"
#endif

#ifdef HAL_CORTEX_MODULE_ENABLED
#include "stm32wlxx_hal_cortex.h"
#endif

#ifdef HAL_CRC_MODULE_ENABLED
#include "stm32wlxx_hal_crc.h"
#endif

#ifdef HAL_CRYP_MODULE_ENABLED
#include "stm32wlxx_hal_cryp.h"
#endif

#ifdef HAL_DAC_MODULE_ENABLED
#include "stm32wlxx_hal_dac.h"
#endif

#ifdef HAL_EXTI_MODULE_ENABLED
#include "stm32wlxx_hal_exti.h"
#endif

#ifdef HAL_FLASH_MODULE_ENABLED
#include "stm32wlxx_hal_flash.h"
#endif

#ifdef HAL_GPIO_MODULE_ENABLED
#include "stm32wlxx_hal_gpio.h"
#endif

#ifdef HAL_GTZC_MODULE_ENABLED
#include "stm32wlxx_hal_gtzc.h"
#endif

#ifdef HAL_HSEM_MODULE_ENABLED
#include "stm32wlxx_hal_hsem.h"
#endif

#ifdef HAL_I2C_MODULE_ENABLED
#include "stm32wlxx_hal_i2c.h"
#endif

#ifdef HAL_I2S_MODULE_ENABLED
#include "stm32wlxx_hal_i2s.h"
#endif

#ifdef HAL_IPCC_MODULE_ENABLED
#include "stm32wlxx_hal_ipcc.h"
#endif

#ifdef HAL_IRDA_MODULE_ENABLED
#include "stm32wlxx_hal_irda.h"
#endif

#ifdef HAL_IWDG_MODULE_ENABLED
#include "stm32wlxx_hal_iwdg.h"
#endif

#ifdef HAL_LPTIM_MODULE_ENABLED
#include "stm32wlxx_hal_lptim.h"
#endif

#ifdef HAL_PKA_MODULE_ENABLED
#include "stm32wlxx_hal_pka.h"
#endif

#ifdef HAL_PWR_MODULE_ENABLED
#include "stm32wlxx_hal_pwr.h"
#endif

#ifdef HAL_RCC_MODULE_ENABLED
#include "stm32wlxx_hal_rcc.h"
#endif

#ifdef HAL_RNG_MODULE_ENABLED
#include "stm32wlxx_hal_rng.h"
#endif

#ifdef HAL_RTC_MODULE_ENABLED
#include "stm32wlxx_hal_rtc.h"
#endif

#ifdef HAL_SMARTCARD_MODULE_ENABLED
#include "stm32wlxx_hal_smartcard.h"
#endif

#ifdef HAL_SMBUS_MODULE_ENABLED
#include "stm32wlxx_hal_smbus.h"
#endif

#ifdef HAL_SPI_MODULE_ENABLED
#include "stm32wlxx_hal_spi.h"
#endif

#ifdef HAL_SUBGHZ_MODULE_ENABLED
#include "stm32wlxx_hal_subghz.h"
#endif

#ifdef HAL_TIM_MODULE_ENABLED
#include "stm32wlxx_hal_tim.h"
#endif

#ifdef HAL_UART_MODULE_ENABLED
#include "stm32wlxx_hal_uart.h"
#endif

#ifdef HAL_USART_MODULE_ENABLED
#include "stm32wlxx_hal_usart.h"
#endif

#ifdef HAL_WWDG_MODULE_ENABLED
#include "stm32wlxx_hal_wwdg.h"
#endif

// Assert
#ifdef USE_FULL_ASSERT
// The assert_param macro is used for function's parameters check.
// @param expr If expr is false, it calls assert_failed function
//         which reports the name of the source file and the source
//         line number of the call that failed.
//         If expr is true, it returns no value.
#define assert_param(expr) ((expr) ? (void)0U : assert_failed((uint8_t *)__FILE__, __LINE__))
void assert_failed(uint8_t* file, uint32_t line);
#else
#define assert_param(expr) ((void)0U)
#endif
